-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 05, 2018 at 09:46 AM
-- Server version: 10.1.21-MariaDB
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `overflow`
--

-- --------------------------------------------------------

--
-- Table structure for table `ci_sessions`
--

CREATE TABLE `ci_sessions` (
  `id` varchar(128) NOT NULL,
  `ip_address` varchar(45) NOT NULL,
  `timestamp` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `data` blob NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ci_sessions`
--

INSERT INTO `ci_sessions` (`id`, `ip_address`, `timestamp`, `data`) VALUES
('pifn6lo21cf92t7auqjjrq63rdjpjub6', '127.0.0.1', 1514985479, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938353333373b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('uquokvjcno8c97k77bqplsc4uhddbshi', '127.0.0.1', 1514987603, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938373331333b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('udpq5qummo05g9hc783507q5l6tmhjqi', '127.0.0.1', 1514987913, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938373631363b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('3u8gdhuk1fihv09cscnmhmf8vfmbqeao', '127.0.0.1', 1514988255, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938373936343b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('c8gpujrsl83o077ku9occpmehq9invlm', '127.0.0.1', 1514988525, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938383237353b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('4ftn10vtv9jhn0mc72sf53fj95g5cc42', '127.0.0.1', 1514988840, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938383833393b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('fqro5tm3imm8igm8q250octvc51ifh9a', '127.0.0.1', 1514989795, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938393530393b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('v6fakngksg6d5d914fng8494r4koe6qj', '127.0.0.1', 1514990044, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343938393932333b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('ko6567uouvjofuihlbag9unoabvdf9lt', '127.0.0.1', 1514990522, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939303338303b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('gdgl8iq6hfliijfn7cqpl4g2odqk42j4', '127.0.0.1', 1514991335, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939313230303b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('bi004o9j7oj4t6e80p4ocebdge83250k', '127.0.0.1', 1514992033, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939313935303b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('cuolacuahtevageid3u7us1il20g9lr1', '127.0.0.1', 1514992736, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939323538303b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('qsdmj3hs1kicoqksh3ghuqa50ka7vs9c', '127.0.0.1', 1514993297, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939333035303b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('967a5qtbqt8rr9pbmetqar5m6vra7oio', '127.0.0.1', 1514993593, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939333436343b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('0usfmuiqohgfatned3np35t4ud68ghcc', '127.0.0.1', 1514993849, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531343939333737303b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('sv7bdd3db2rlfp9d63jhm8uuhu41ukco', '127.0.0.1', 1515010824, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031303631353b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('r0c977utb3akchr75c2pc2dftm2mccmc', '127.0.0.1', 1515011175, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031303936343b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('ul3d5jhth5oapel4l597l5dvketa0u5a', '127.0.0.1', 1515011669, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031313434333b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('v9p64s8e5juvr4rfc5llbt8eajebu13u', '127.0.0.1', 1515012194, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031313932373b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('3879vtlkrfu5vu21vjkd2okc51uvpi36', '127.0.0.1', 1515012506, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031323233373b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('egddfijok7p64ilft8246v84auita8s3', '127.0.0.1', 1515012773, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031323632333b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('k0l2o1cdsscbgr273p3snucbrklf8ndo', '127.0.0.1', 1515013203, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031333033323b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b),
('livp198ig9fcgu4kt23o0kajgv0hanvb', '127.0.0.1', 1515013617, 0x5f5f63695f6c6173745f726567656e65726174657c693a313531353031333333333b69647c733a323a223234223b6e616d657c733a343a227761656c223b7069637c733a373a226263322e706e67223b);

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `question_id` int(11) NOT NULL,
  `comment` text NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `user_id`, `question_id`, `comment`, `date`) VALUES
(1, 24, 28, '<p>ascsacasas</p>', '2018-01-03 15:06:39'),
(2, 24, 28, '<p>ascsacasasaacascadscadcasdcSDVSDVSDV</p>', '2018-01-03 15:07:13'),
(3, 24, 28, '<p>dsfsdff</p>', '2018-01-03 15:16:28'),
(4, 24, 28, '<p>sdvsdvsdv</p>', '2018-01-03 21:04:11');

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `post` text NOT NULL,
  `tags` text NOT NULL,
  `owner` int(11) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `title`, `post`, `tags`, `owner`, `date`) VALUES
(28, 'a test title to show how the title display', '<ul>\r\n<li>&nbsp; a testa testa testa testa test v a test a testa test</li>\r\n<li>a testa test<hr />wefewf</li>\r\n</ul>', 'HTML,PHP7,C++,CSS', 24, '2017-11-04 11:18:38'),
(29, 'another test title', '<p>regerge etg e erg erg</p>', 'JavaScript,CCNA', 24, '2017-11-04 11:45:44'),
(30, 'test title', '<p>dfgedgr</p>', 'PHP,HTML', 24, '2017-11-05 15:16:33');

-- --------------------------------------------------------

--
-- Table structure for table `tags`
--

CREATE TABLE `tags` (
  `id` int(11) NOT NULL,
  `name` varchar(30) NOT NULL,
  `summary` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tags`
--

INSERT INTO `tags` (`id`, `name`, `summary`) VALUES
(1, 'JavaScript', 'لغة برمجة عالية المستوى تستخدم أساسا في متصفحات الويب لإنشاء صفحات أكثر تفاعلية. يتم تطويرها حاليا من طرف شركةنتسكيب وشركة موزيلا, كانت لغة الجافاسكريبت موجهة للمبرمجين الهوات والغير محترفين، إلا أنه تزايد الاهتمام بها وجذبت اهتمام مبرمجين محترفين بعد إضافتها لتقنيات جديدة كإنتشار تقنية الاجاكس التي أدت إلى سرعة في التفاعل بين الخادم والعميل.'),
(2, 'C#', 'أحد لغات بيئة الدوت نت لتطوير البرامج من انتاج شركة ميكروسوفت , تتميز سي شارب بأنها أحد لغات البرمجة الشيئيه وتجمع صفات السي والبيزك المرئي حيث انها تستخدم القواعد الخاصه بالسي وسرعة التطوير كما في البيزك المرئي, لغة السي شارب موجهه الى مبرمجي الفيجول سي ومبرمجي السي على انها امتداد لهذه اللغات.'),
(3, 'C++', 'هي لغة برمجة كائنية، متعددة أنماط البرمجة، مصرفة، سكونية الأنماط. وتضم العديد من ميزات لغات البرمجة عالية المستوى ومنخفضة المستوى, تعتبر سي++ إحدى اللغات الأكثر شيوعاً وقد استخدمت على نطاق واسع في بناء أنظمة التشغيل والتعامل مع البنية الصلبة للحاسوب ابتداءً من الأنظمة البرمجية وبرامج المستخدم، مروراً بمشغلات الأجهزة والأنظمة المضمنة وانتهاءً بالمخدمات عالية الأداء وبرامج التسلية نظراً لقدرة تصريفها إلى كود لغة تجميع شديد الفعالية.'),
(4, 'PHP', 'هي لغة برمجة نصية صممت أساسا من أجل استخدامها لتطوير وبرمجة تطبيقات الويب. كما يمكن استخدامها لإنتاج برامج قائمة بذاتها وليس لها علاقة بالويب فقط, بي إتش بي لغة مفتوحة المصدر ويطورها فريق من المتطوعين تحت رخصة بي إتش بي، تدعم البرمجة كائنية التوجه وتركيبها النحوي يشبه كثيرا التركيب النحوي للغة السي هذا بالإضافة إلى أنها تعمل على أنظمة تشغيل متعددة مثل لينكس وويندوز.'),
(5, 'HTML', 'هي لغة ترميز تستخدم في إنشاء وتصميم صفحات ومواقع الويب، وتعتبر هذه اللّغة من أقدم اللّغات وأوسعها استخداما في تصميم صفحات الويب. هي هيكل صفحة الويب وتعطي متصفّح الإنترنت وصفا لكيفيّة عرضه للمحتوياتها، فهي تعلمه بأنّ هذا عنوان رئيسي وتلك فقرة وغير ذلك الكثير.'),
(6, 'HTML5', 'تم تقديم عدد من العناصر الجديدة والتي تسهل من فكرة تكوين الصفحات، حسب ما نقوم به يدوياً في XHTML 1.0 بالإضافة إلى تسهيل الأمور على محركات البحث في قراءة الصفحات ومعرفة ما هي أجزاء الصفحة الفعلية (الجزء العلوي (Header)، القائمة (Navigation)، الجزء الرئيسي (Main)، المحتوى (Sections) والجزء السفلي (Footer).كما توفر عدد من بيئات العمل المختلفة لتكوين الرسومات والفيديو والعديد من المميزات التي تسهل الكثير مما يتم القيام به و حسّن الإصدار الجديد أداء اللغة، حيث ارتفعت سرعة المُعالجة إلى ثلاث مرّات تقريبًا، كما انخفض استهلاك الذواكر بشكل كبير، حسب التجارب التي أجرتها مُنظمة زيند Zend التي ساهمت في الإصدار الجديد.'),
(7, 'PHP7', 'أُجريت اختبارات PHP 7 على بعض منصّات إدارة المحتوى مثل وردبريس ودروبال، حيث ارتفع عدد الطلبات التي يُمكن مُعالجتها في الثانية الواحدة، فضلًا عن سرعة في المُعالجة أسرع بـ 72% عند استخدام منصّة دوربال 8 مع بي اتش بي 7 ,وأضافت اللغة دعمًا لبعض المفاهيم البرمجية الشائعة الاستخدام في لغات ثانية مثل تحديد نوع البيانات“Return Type” التي تُعيدها الدوال البرمجية “Functions” ، بالإضافة إلى بعض المُعاملات الجديدة لتسهيل العمليات المنطقية.'),
(8, 'jQuery', 'هي مكتبة خاصة بالجافا سكريبت تقوم باختصار العديد من النصوص البرمجية المكررة والمهام المعروفة وذلك لتسهيل عملية البرمجة, تتميز مكتبة الـ جي كويري بانها مكتوبة فقط بلغة الـ JavaScript وحجمها صغير جدا و أنها مفتوحة المصدر و قادرة علي العمل مع المكتبات الأخري وعمل التأثيرات الحركية علي مواقع الويب و تقوم بتوفير كم هائل من الإضافات التي تعمل بالإعتماد عليها. '),
(9, 'CCNA', 'هي شهادة من سيسكو تمنح لذوى المعرفة بالشبكات فهى تثبت أن حاملها متمكن من تركيب واعداد وتشغيل وصيانة الراوتر والسويتشات متوسطة الحجم وأيضا تركيب وتجهيز التوصيلات في أماكن بعيدة أو في شبكة واسعة النطاق\"wan\" , ولكى تصبح خبير شبكات معتمد من سيسكو يجب عليك النجاح في امتحان \"640-802\" أو النجاح في كلا من امتحان \" ICND1 (100-101)\" وامتحان \"ICND2 (200-101)\". كما أن النجاح في امتحان \"ICND1\" يمنحك شهادة \"CCENT\" (فنى الشبكات الداخلية المعتمد من سيسكو)علما بأن الدرجات المطلوبة للنجاح في هذه الامتحانات تحدد باستخدام الإحصاء التحليلى كما أنها معرضة للتغير. عند الانتهاء من الامتحان، يستلم الممتحنين تقرير بالنتيجة مع درجة الممتحن والدرجة المطلوبة للنجاح.ولا تنشر سيسكو الدرجات المطلوبة للنجاح في هذه الامتحانات لأن اسئلة الامتحانات والدرجات المطلوبة للنجاح معرضة للتغير في أى وقت وبدون اشعار.'),
(10, 'Python', 'من لغات المستوى العالي، تتميز ببساطة كتابتها وقراءتها, سهلة التعلم و تستخدم أسلوب البرمجة الكائنية, مفتوحة المصدر وقابلة للتطوير. تعتبر لغة بايثون لغة تفسيرية, متعددة الأغراض وتستخدم بشكل واسع في العديد من المجالات كبناء البرامج المستقلة باستخدام الواجهات الرسومية المعروفة وفي عمل برامج الويب، بالإضافة إلى استخدامها كلغة برمجة نصية للتحكم في أداء بعض من أشهر البرامج المعروفة أو في بناء برامج ملحقة لها. وبشكل عام يمكن استخدام بايثون لبرمجة البرامج البسيطة للمبتدئين، ولإنجاز المشاريع الضخمة كأي لغة برمجية أخرى في نفس الوقت. غالباً ما يُنصح المبتدئين في مجال البرمجة بتعلم هذه اللغة لأنها من بين أسرع اللغات البرمجية تعلماً.'),
(11, 'CSS', 'هي لغة تنسيق لصفحات الويب تهتم بشكل وتصميم المواقع، صممت خصيصا لعزل التنسيق (الألوان - الخطوط - الأزرار....) عن محتوى الصفحات المكتوب (بلغة مثلا إتش تي إم إل) وينطبق ذلك على الألوان والخطوط والصور والخلفيات التي تستخدم في الصفحات، بمرونة وسهولة تامة. هذه التقنية تعنى بالمظهر الكلي لصفحات مواقع الويب من ألوان و صور و غيره ويمكن اضافته للصفحة بعدة طرق أفضلها التضمين الخارجي بكتابة كود السي إس إس في ملف منفصل. وقد تم تطوريها لتصل حاليا إلى سي إس إس 3. '),
(12, 'java', 'جافا عبارة عن لغة برمجة كينونية مشتقة من لغة سي بلس بلس، و لكنها تمتاز عن اللغات الأخرى بأنها تمكنك من كتابة برنامج مرة واحدة فقط و من ثم تستطيع أن تشغل البرنامج على أي جهاز كمبيوتر آخر، حتى إذا كان من نوع آخر أو يعمل على نظام تشغيل مختلف، بدون الحاجة لإعادة تركيب البرنامج. الهدف الأساسي لنشأة جافا هو إيجاد لغة مشابهة للغة سي+ + من حيث التركيب النحوي ، كائنية التوجه، و مصممة للعمل علي اّلة إفتراضية بحيث لا تحتاج إلي الترجمة من جديد عند استخدام برامجها على منصة تشغيل أو نظام تشغيل جديد.'),
(13, 'Routing and Switching', 'روتوكولات توجيه و نقل البيانات بين الراوترات كالRIP,OSPF,EIGRP و غيرها و كيفية عملها بالاضافة الي تقنيات الاسويتشات كال Vlans و Spanning tree prtocols '),
(14, 'Networking', '');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `email` varchar(40) NOT NULL,
  `password` varchar(500) NOT NULL,
  `phone` varchar(12) DEFAULT NULL,
  `age` varchar(5) DEFAULT NULL,
  `career` varchar(50) DEFAULT NULL,
  `profile_pic` varchar(50) NOT NULL DEFAULT 'profile.png'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `phone`, `age`, `career`, `profile_pic`) VALUES
(24, 'wael', 'wael.fudlallah@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '0995054572', '16', 'طالب', 'bc2.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `ci_sessions`
--
ALTER TABLE `ci_sessions`
  ADD KEY `ci_sessions_timestamp` (`timestamp`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `quest-user` (`owner`);

--
-- Indexes for table `tags`
--
ALTER TABLE `tags`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
--
-- AUTO_INCREMENT for table `tags`
--
ALTER TABLE `tags`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `questions`
--
ALTER TABLE `questions`
  ADD CONSTRAINT `quest-user` FOREIGN KEY (`owner`) REFERENCES `users` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
